{
    "mainDscHead": "Master in-demand computing skills and hone your innovation and creativity with a University of London degree.
    Open the door to sought - after technology careers with a world - class online Bachelor of Science(BSc) in Computer Science degree from the University of London.You will master in -demand computing skills coma * solve complex problems coma * and hone your innovation and creativity.The hands - on project - based approach will help develop the technical and transferable skills needed
    for a fulfilling career in your field.
    ",

    "mainDsc": "Specialise in 1 of 7 cutting edge topics. Choose from the following areas of focus: Machine Learning and AI, Data Science, Web and Mobile Development, Physical Computing and the Internet of Things, Games Development, Virtual Reality, or User Experience.
    Create a portfolio of work that furthers your career.Develop skills in computing with a strong programming and mathematics focus,
    plus project management,
    presentation skills and teamwork.Create a portfolio of coursework to present to potential or existing employers.
    Build technical and transferable skills needed
    for a career in high - growth industries.The course material ranges from entry - level subjects to specialised topics.Hold a degree outside of computer science ? The curriculum allows you to update your marketable and competitive skills through commercial applications of computing practices.The flexible degree programmes are designed
    for busy schedules.You can study online at your own pace.
    Earn a degree from a university with global reputation.The University of London,
    established by Royal Charter in 1836,
    is a globally recognised learning institution.UoL currently has over 120,
    000 students in London,
    and a further 50,
    000 studying abroad in 180 countries.
    ",

    "price" : "£11,229 - £16,790*",
    "price_dsc": "Depending upon geographic location",
    "time": "3 – 6 years",
    "timeDsc": "14 to 28 hours per week",
    "credits": "<div className='flex my-4 lg:my-auto lg:items-center flex-col space-y-3'>\r\n                        <div>\r\n                            <Image width={170} height={50} className=\"\" src={`\/download_on_the_app_store_badge_en.svg`} \/>\r\n                        <\/div>\r\n                        <div>\r\n                            <Image width={170} height={50} className=\"\" src={`\/en_generic_rgb_wo_45.png`} \/>\r\n                        <\/div>\r\n                        <div>\r\n                            <Image width={82} height={120} className=\"\" src={`\/2018-B-Corp-Logo-Black-S.png`} \/>\r\n                        <\/div>\r\n                    <\/div>",

    Online Courses
    The programme is offered twice per year in April and October.

    Apply today,
    no application fee
    for 2022 entry!

    The deadline to apply is March 7,
    2022.

    The next cohort starts on April 4,
    2022.

    If you have a question please contact the University of London via their Student Enquiry System.

    View the Prospectus and Programme Specification

    Choose Your Path
    Whether you have high school qualifications or experience working in a computer science field,
    earning a valuable degree helps move your career forward.If you do not meet the academic requirements
    for
    direct entry,
    apply via the performance based admission route.

    Learn more about performance - based admission

    About the Programme

    Admissions
    There are two open application times each year corresponding to the two study sessions.Apply via direct entry,
    or performance based admission
    if you do not meet the academic requirements
    for
    direct entry.

    Learn more about admissions

    Programme
    The course material ranges from entry - level subjects to specialised topics.If you already have a degree outside of computer science,
    the curriculum will bring you up - to - date on the latest industry applications and practices.

    Learn more about the programme

    Careers
    With the BSc Computer Science,
    you can apply
    for a range of computational and mathematical jobs in the creative industries,
    business,
    finance,
    education,
    medicine,
    engineering and science.Typical job titles include application programmer,
    software engineer,
    creative coder,
    video game developer and systems analyst.

    Learn more about careers

    Student Experience
    Students access lectures through the Coursera platform,
    but are advised and assessed by UoL faculty and teaching assistants on a rigorous set of assignments,
    projects,
    and exams.The flexible degree programmes allow you to study online according to your own schedule.

    Learn more about student experience

    About University of London
    The University of London has 17 independent member Institutions,
    including Goldsmiths.The University of London has long offered degrees via distance learning,
    offering over 100 programmes in over 180 countries.

    Learn more about University of London

    Try a Degree Course
    The University of London offers a number of online taster courses and Massive Open Online Courses(MOOCs),
    designed to introduce you to themes included in degree programmes.Choose from three open courses that explore topics covered in the BSc Computer Science degrees.

    Sample a course
    Events
    Dec01
    Applications open
    for the April 2022 cohort

    Mar01
    BSc Computer Science Admissions Webinar with Coursera | Watch the recording

    Mar07
    Application deadline

    Study
    for a BSc in Computer Science with the University of London
    Study
    for a BSc in Computer Science with the University of London
    News
    Frequently Asked Questions

    Do the same faculty teach online and on - campus courses ? ‎

    Will there be a graduation ceremony ? ‎

    How long will it take to complete the degree
    if I am working
    while studying ? ‎

    Is the degree the same as one offered on campus in the UK ? ‎

    Can I take my exams online or do I need to come to the UK
    for
    them ? ‎

    What 's on the degree certificate?‎

    Can I receive credit
    for the open courses associated with this programme ? ‎

    Who can I contact
    if I have a question ? ‎

    What is the enrollment process ? ‎

    How do I access the degree on Coursera ? ‎

        What tutor support will I receive ? ‎

        What is the University of London’ s experience with online / distance learning degrees ? ‎

        Do graduates of the online programme earn the same degree as graduates of the on - campus programme ? ‎

        Can you
    switch
    between online and on - campus programmes ? ‎

    What is the school year schedule ? ‎

    What career options will I have with this degree ? ‎

    Can I transfer credits into the programme ? ‎

    Are there networking opportunities to interact with fellow students ? ‎

    Can I sample a course ? ‎

    What are the courses available ? ‎

    Do students choose a concentration ? ‎

    What
    if I don’ t meet admissions requirements ? ‎

    Is work experience required ? ‎

    Is there an application fee ? ‎

    Is there financial aid ? ‎

    Is the programme eligible
    for US Federal student aid or private funding through Sallie Mae loans ? ‎

    Do I need a Computer Science background ? ‎

    Are there career services available ? ‎

    Do online students have access to on - campus facilities ? ‎

    Will online students get a student ID card ? ‎

        I have completed the Google IT Support Professional Certificate.How do I get course credit to count towards my degree ? ‎

            How many courses are needed to complete the programme ? ‎
            Coursera does not grant credit, and does not represent that any institution other than the degree granting institution will recognize the credit or credential awarded by the institution;
        the decision to grant,
    accept,
    or transfer credit is subject to the sole and absolute discretion of an educational institution.

    We encourage you to investigate whether this degree meets your academic and / or professional needs before applying.


} {




    "mainDscHead": "Learn from the #1 public research university in the U.S. and join the next generation of data scientists.
    The University of Michigan School of Information’ s online Master of Applied Data Science(MADS) degree is designed
    for aspiring data scientists to learn and apply skills through hands - on projects.You’ ll learn how to use data to improve outcomes and achieve ambitious goals.
    "

    The MADS curriculum prepares you to be a leader in the field through mastery of core data science concepts like machine learning and natural language processing.By diving deep on key topics such as privacy,
    data ethics,
    and persuasive communication,
    you’ ll be prepared to succeed within today’ s organizations.You’ ll also work with real data sets from top companies as you build a work portfolio that showcase your skills.Learn the systems and techniques that help organizations overcome data overload and make smart decisions.

    Whether you’ re looking to create real estate market forecasts or use data to study Russian literature,
    this online Master’ s program teaches the skills you need
    for success in an ever - changing field.

    LEARN FROM A TOP 10 INFORMATION STUDIES PROGRAM
    The University of Michigan’ s School of Information(Top 10 Information Studies Program
        for 2022, U.S.News and World Report) has a long - established partnership with Coursera,
    and its faculty are experts at teaching online.More than 1 million learners have taken courses online from UMSI faculty since launching on Coursera.

    PROVEN CAREER OUTCOMES
    The University of Michigan’ s School of Information prepares students to be leaders in the field.Graduates from the on - campus Master of Science in Information program have a 98 % +job placement rate and go on to become data scientists at places like Google,
    Facebook and Amazon.

    DIVERSE BACKGROUNDS WELCOME
    There are only a few basic technical prerequisites(knowledge of statistics and Python) for the program.Students are not required to have a bachelor’ s degree in a science or math discipline,
    or work experience in a technical field.Students who need a refresher on statistics and Python are encouraged to take the Statistics
    for Python and Python 3 Programming Specializations,
    which are also offered by the University of Michigan through Coursera.

    LEADERSHIP - FOCUSED LEARNING
    While other data science master’ s programs focus on computer science theory,
    this online degree equips students
    for leadership with an end - to - end perspective on data science.Students are prepared to solve real - world problems through expertise on contextual inquiry,
    data visualization and presentation.

    RENOWNED FACULTY
    University of Michigan professors are among the most respected and passionate in the field.Their expertise provides the highest quality of instruction to online degree learners.Students get direct access to faculty and graduate students through live office hours and email conversations.

    UNIVERSITY OF MICHIGAN COMMUNITY
    The University of Michigan community provides a wide range of student services,
    including access to libraries and exclusive job listings.Students who complete online graduate degrees join the 630,
    000 - strong Michigan alumni network,
    and are invited to participate in commencement ceremonies in Ann Arbor.

    "price": "$31,688 – $42,262 USD"
    "time": "1 – 3 years"
    "credits": "34 credit hours"
    Completely online
    The application
    for the Spring / Summer(May) 2022 cohort is open.

    The final application deadline is March 15,
    2022.

    Classes
    for the Spring / Summer(May) 2022 cohort will begin on May 3,
    2022.


    Get Started
    Interested in this degree ? Need more programming experience ? The following two specializations from University of Michigan will give you the Python and statistics background needed to begin the Master of Applied Data Science degree :

    The Python 3 Programming Specialization teaches the basics of programming in Python 3. It covers fundamental techniques like variables,
    conditionals,
    and loops.The course also includes intermediate materials like keyword parameters,
    list comprehensions,
    lambda expressions,
    and class inheritance.

    The Statistics with Python Specialization covers beginning and intermediate concepts of statistical analysis using the Python programming language.Learners will explore where data comes from,
    what types of data can be collected,
    data design,
    data management,
    and how to effectively carry out exploration and visualization.Students will utilize data
    for estimation and assessing theories,
    construct confidence intervals,
    interpret inferential results,
    and apply more advanced statistical modeling procedures.

    Learn more about the application requirements
    About the Program

    Admissions
    The University of Michigan School of Information’ s Master of Applied Data Science welcomes applicants from diverse backgrounds.The curriculum is designed
    for applicants who want to devote themselves to full - time study,
    as well as those who want to complete their degree
    while working.

    Learn more about Admissions

    Academics
    The Master of Applied Data Science Program equips students with the skills needed to apply data science in any number of real world contexts.It blends theory,
    computation,
    and application in a flexible online format.

    Learn more about Academics

    Careers
    University of Michigan School of Information master’ s students earn the highest average salaries of any graduate program in similar areas of study,
    and 98 % + of our students report finding jobs in their field of choice.

    Learn more about Careers

    Student Experience
    Students will have access to renowned University of Michigan faculty and resources.They will also have opportunities to build community with other University of Michigan School of Information students who are working on graduate degrees.

    Learn more about Student Experience

    About University of Michigan
    With 102 top - 10 graduate programs,
    the University of Michigan is ranked as the #1 public research university in the U.S. by the National Science Foundation.



Learn more about University of Michigan



Get Started

If you don't have prior programming and statistics knowledge, 2 online courses available from the University of Michigan can prepare you to begin this degree program.



Learn more about how to get started

Events

Oct18

Live Q&A with MADS Faculty Members Kevyn Collins-Thompson, Paramveer Dhillon and Elle O'Brien | Watch here



Mar15

Spring/Summer (May) 2022 Cohort Final Application Deadline



Learn more about Michigan School of Information's Master of Applied Data Science Degree

Learn more about Michigan School of Information's Master of Applied Data Science Degree

News





Frequently Asked Questions



Is the online program the same as the on-campus program?‎



Do graduates of the online program earn the same degree as graduates of the on-campus program?‎



Can you switch between online and on-campus programs?‎



What is the time commitment required? Can working adults complete this program?‎



What is the school year schedule? ‎



How long does it take to complete the program?‎



What career options will I have with this degree?‎



Can I transfer credits into the program?‎



Are there online office hours with instructors?‎



Are there networking opportunities to interact with fellow students?‎



Do the same faculty teach online and on-campus courses?‎



How does the online format work?‎



Can I sample a course?‎



Who can I contact if I have more questions?‎



What are the courses available?‎



Do students choose a concentration?‎



How many courses can students take at a time? How many courses are needed to complete the program?‎



How flexible is the schedule?‎



Are internships part of the program?‎



What are the application requirements?‎



Do I need a Computer Science background?‎



What are the prerequisites?‎



What if I don’t meet admissions requirements?‎



Is work experience required?‎



Is there an application fee?‎



How do I apply?‎



Is there financial aid?‎



What is the program cost, and what is the payment schedule?‎



Are there career services available?‎



Do online students have access to on-campus facilities?‎



Can online students participate in student clubs and activities?‎



What are the English proficiency requirements?‎



How do I submit international transcripts?‎

Coursera does not grant credit, and does not represent that any institution other than the degree granting institution will recognize the credit or credential awarded by the institution; the decision to grant, accept, or transfer credit is subject to the sole and absolute discretion of an educational institution.



We encourage you to investigate whether this degree meets your academic and/or professional needs before applying.





}

{





"mainDscHead":"Build a strong cross-functional foundation in management with expertise in analytics.

In this programme, you’ll build the analytical skill set necessary to advance your career in today’s data-driven, analytics-focused business environment, while also developing essential management skills you can use to pivot into rewarding managerial roles."



The unique curriculum prepared by accomplished Jindal Global Business School faculty at O.P. Jindal Global University focuses on the holistic application of business analytics alongside management, marketing, finance, and more. As you advance through the programme, you’ll build the expertise to pursue new roles within your organization or industry, or move into new opportunities in the technology and analytics sector.



You will also be able to establish connections with a diverse community of peers from across the globe. Learners in this program come from multiple industries and geographies—and bring with them a wide array of knowledge and experience—and you’ll have ample opportunities to forge valuable relationships and grow your professional network. The last cohort had learners from more than 10 countries with work experience ranging from beginner to advanced levels.



With the skills you gain in this programme, you'll be prepared to pursue roles in a wide range of roles, including business analyst, management consultant, HR analyst, marketing analyst, supply chain analyst, risk and financial analyst, and more.



Jindal Global University (JGU) is internationally ranked and nationally recognised as an Institute of Eminence by the Ministry of Human Resource Development, Government of India. JGU programs are accredited by National Assessment and Accreditation Council and recognised by the University Grants Commission of India.



What makes this Master's degree unique?

Make data-driven decisions that drive positive business results

In this programme, you’ll learn the skills and strategies to deliver critical business solutions using data. By combining analytical and managerial proficiency, you can position yourself for career success as a data-driven business leader. Learning these skills is essential to advance your career, as today’s rapidly evolving and fast-paced digital economy necessitates being able to understand and solve business challenges holistically and drive growth through strategic, data-informed decision-making.



Learn at your own pace

Earn your degree while balancing your professional and personal commitments. The programme is designed to seamlessly integrate with your unique learning and career journey. With a high degree of flexibility, you’re able to learn at your own pace, and as live lectures and learning sessions are recorded, you can access the material at a time that’s right for your schedule. If you dedicate 9-10 hours of weekly effort to complete this degree, you can expect to complete the program in approximately 24 to 36 months.



Enrich your learning in a global classroom

As a student in this programme, you’ll join a dynamic global community of learners who bring a diverse array of backgrounds and experiences to the classroom. With students joining from more than 10 different countries, you’ll have a unique range of opportunities to network, collaborate, and build important professional relationships with peers from around the world. The global character of the diverse student community is reflected in the range of case studies and assignments from international businesses and brands, and Coursera’s platform integrations make interactions with peers and faculty easy and enjoyable.



Build a comprehensive skill set through interactive, job-ready learning

As you engage with the program’s unique curriculum, you’ll develop critical thinking, decision-making, and problem-solving skills as you learn from faculty that bring industry experience, research, and theoretical knowledge to the classroom. You’ll also learn in-demand skills like R Studio and Python through interactive, hands-on environments such as Coursera Labs and Guided Projects.



"price":"Rs. 550,000 / $7,500 USD"

"priceDsc":"Estimated 10 hours a week"

"time":"24 - 36 months"

"timeDsc":"Estimated 10 hours a week"

"credits":"80 credits"

Completely online

Applications for Spring 2022 cohort closing soon!



Priority deadline: January 15, 2022

Final application deadline: February 12, 2022

Extended application deadline: March 5, 2022

There are two cohorts per year: March and September. Classes begin March 1, 2022.



If you have any questions, please contact online@jgu.edu.in.



Want to learn more about the program? Watch the admissions webinar here.



Wish to speak with an Enrolment Counsellor? Request callback here



About the Program



Admissions

Applicants must have a Bachelor’s degree from a recognized university in India or abroad. No work experience is required.



Apply now



Academics

The programme is designed with a well-balanced mix of Management and Analytics, and offers you the opportunity to specialize in areas of your interest through a wide selection of electives in the final semester of the program.



Learn more about academics



Careers

Get equipped to take on in-demand career opportunities at the intersection of Business Management and Analytics. You will be job-ready and in a position to advance your career in specialized analytics roles across various industries and business domains.



Learn more about careers



Student Experience

Keep pace with your job, while pursuing your studies. You will be required to work on projects, often in groups, solve hands-on assignments, and attend live sessions with program faculty. You’ll also have the opportunity for peer-learning and interacting with each other.



Learn more about student experience



About the University

JGU is India's No. 1 ranked private university and India's No. 1 institution dedicated to social sciences, arts and humanities (QS World University Rankings 2021).



Learn more about JGU



JGU courses

Find out more about courses offered by O.P. Jindal Global University on Coursera.



Find more JGU courses

Events

Dec8

Webinar: Why should you pursue an online MBA in Business Analytics? | Watch here



Dec23

Webinar: How to ace your application | Watch here



Mar5

Extended application deadline



Mar1

First day of classes | Spring 2022 cohort



Redefining the competency of future leaders

Redefining the competency of future leaders

Learn as part of a diverse cohort of global learners from some of the most experienced and reputed teachers in the domain of business management and analytics. Become acquainted with essential management concepts and analytics techniques through novel pedagogical techniques like case studies, role play, simulations, hands-on exercises, group activities, debates, and reflection.



Frequently Asked Questions



What appears on the degree certificate? Is it the same degree as the on-campus program?‎



What career options will I have with this degree?‎



Is O.P. Jindal Global University fully accredited?‎



How does the online format work?‎



How long does it take to complete the program if I’m working while studying?‎



What is the time commitment required? How flexible is the schedule?‎



Is there an application fee?‎



What are the prerequisites and application requirements?‎



Do I need a business analytics background? e.g. [data science, computer science] Is work experience required?‎



Do I have to submit official transcripts to apply?‎



Who can I contact if I have more questions?‎



Are there any additional requirements for international students?‎

Coursera does not grant credit, and does not represent that any institution other than the degree granting institution will recognize the credit or credential awarded by the institution; the decision to grant, accept, or transfer credit is subject to the sole and absolute discretion of an educational institution.



We encourage you to investigate whether this degree meets your academic and/or professional needs before applying.





}

{







"mainDscHead":"The fastest, most affordable way to complete your bachelor’s degree online from a top 9 research school in Texas while leveraging your previous college or military credits.

The Bachelor of Applied Arts and Sciences (B.A.A.S.) program from the University of North Texas (UNT) is designed to streamline your path to a fully accredited bachelor’s degree by making it easy to transfer course work you’ve previously completed for technical, applied, or U.S. military credit."



Our B.A.A.S degree accepts and builds on these unique credits, combining them with course work in eight distinct concentrations so you can meet your individual or career goals. The degree is designed to help transfer students from community colleges and technical institutions, non-traditional students with college credit, and veterans or active-duty military personnel finish their bachelor’s degree faster. The B.A.A.S. degree does this by accepting many types of credits that other degree programs won’t accept.



What makes this degree unique?

No need to start over. Build a bridge by transferring your educational experience towards your degree. Named one of America’s 100 Best College Buys® for 24 consecutive years, UNT pairs each applicant with an advisor to create a customized degree plan focusing on the “missing pieces” required to complete the degree.



Built for you. B.A.A.S. students receive high-touch support and career services as applicants and enrolled students. With eight concentrations in administration, organizational supervision, social wellness and community, hospitality, media innovation, consumer behavior, data analytics, and information technology, you can customize your coursework to create a degree path that’s right for you and your career.



Attainable and flexible. Receive the same high-quality instruction as on-campus students and earn the same degree while learning when and where it works best for you.



Commitment to excellence. Founded 130 years ago, UNT is a well-established research institution that ranks in the top 100 nationally for social mobility. UNT is also a majority-minority university, 42 percent of on-campus students at UNT are first-generation students, and the school ranks in the top 50 nationally for diversity.



"price":"$330 USD/credit hour for most"

"time":"15+ hours of study/wk per course"

"credits":"Transfer at least 45 hours of credit towards the 120 credit degree."

Completely online

The application for the Fall 2022 cohort is now open.



The early application deadline is March 18, 2022.



The final application deadline is July 29, 2022.



Have questions? Attend an upcoming webinar to learn more.



March 10: Concentration Spotlight: Administration

March 15: B.A.A.S. Program Overview

March 22: Concentration Spotlight: Social Wellness and Community

April 5: Concentration Spotlight: Media Innovation

April 12: Concentration Spotlight: Data Analytics

April 19: B.A.A.S. Program Overview



Wondering if the B.A.A.S. degree is a good fit for you?

Get familiar with online learning by taking a stand-alone course from the University of North Texas. In Research Design: Inquiry and Discovery, you will learn about the essential skill of asking good questions. The course covers topics like the basis of human curiosity, development of questions, connections between questions and approaches to information gathering design, the differences between experimental and non-experimental designs, data analysis, and the ethics of inquiry projects. In Contemporary Biology, you will be introduced to biology as it applies to your everyday life. You will explore the interplay between science and self through a personalized case study of yourself and your environment.



Learn more

About the Program



Admissions

The B.A.A.S. program provides you with a direct path to a fully accredited bachelor’s degree if you have completed course work for technical, applied or military credit or have a technical or applied degree from a community or technical college. Our B.A.A.S. degree accepts and builds on these unique credits, combining them with course work intended to meet your individual or career goals.



Learn more about Admissions



Academics

B.A.A.S. students will complete the university core curriculum and additional upper level coursework to earn their bachelor’s degree. With eight concentrations in administration, organizational supervision, social wellness and community, hospitality, media innovation, consumer behavior, data analytics, and information technology, you can customize your coursework to create a degree path that’s right for you and your career.



Learn more about Academics



Careers

The B.A.A.S. degree provides personalized advising to build on previously acquired academic, workforce/technical, and military credits. Focused academic concentrations and an integrative, multidisciplinary core tailor the college experience to the professional career goals of each student. Students who earn the B.A.A.S. degree are prepared to tackle new challenges as leaders in business, industry, non-profit organizations, and community engagement.



Learn more about Careers



Student Experience

The B.A.A.S. degree combines experience, discovery, collaboration and application. The courses have been developed by the University of North Texas (UNT) and are taught by UNT faculty with the support of teaching assistants. Courses are delivered on the Coursera platform giving you access to innovative learning technology and the flexibility to study on your schedule and on your preferred device.



Learn more about Student Experience



About the University of North Texas

UNT is a public research university located in Denton, Texas. As one of Texas' largest universities, they offer 105 bachelor's, 88 master's and 37 doctoral degree programs within the university's 14 colleges and schools. UNT Online offers more than 80 online program options.



Learn more about the University of North Texas



About the Applied Arts and Sciences Unit

The Applied Arts and Sciences unit (known as the B.A.A.S. unit) of New College at the University of North Texas aims to maximize the potential of each individual. Prior education and work experience are integrated with advanced undergraduate courses as students earn the B.A.A.S. degree.



Learn more about the B.A.A.S. Unit

Events

Mar10

Administration Concentration Spotlight | 11:30 pm CT | Sign up to attend



Mar15

Program Overview Webinar | 11:30 am CT | Sign up to attend



Mar22

Social Wellness and Community Concentration Spotlight | 11:30 pm CT | Sign up to attend



Apr19

Program Overview Webinar | 11:30 am CT | Sign up to attend



Learn more about University of North Texas' Bachelor of Applied Arts and Sciences Degree

Learn more about University of North Texas' Bachelor of Applied Arts and Sciences Degree

News









Frequently Asked Questions



What are the English requirements?‎



Will enrolling in this degree make me eligible for a student visa?‎



What do I need to know if I am an international student?‎



Can I continue to work as I complete my UNT classes?‎



Can I finish my core classes at a community college?‎



Can I finish my Professional Foundations courses at a community college?‎



If I am a former or returning UNT student, do I have to go through the application process again? Who should I contact?‎



How long will it take to get a B.A.A.S. degree?‎



How many hours am I required to take at the University of North Texas?‎



What are upper division courses and how are they different?‎



What is the approximate cost of each course?‎



What types of scholarships and financial aid are available?‎



How do I apply for scholarships?‎



How do I apply for financial aid?‎



How do I check on my financial aid awards?‎



When can I start taking classes?‎



Where do I find books, and how much will they cost?‎



How do I request a tax return transcript for verification?‎



Do the same faculty teach online and on-campus courses?‎



What is a concentration?‎



What’s on the degree certificate?‎



How do I know if my application is complete?‎



Can UNT accept my U.S. Military credit as academic credit for the B.A.A.S. degree?‎



How can I check the status of my application?‎



How will I receive an admissions decision?‎



Who can I contact if I have a question?‎



How do I access the degree on Coursera?‎



Can you switch between online and on campus programs?‎



Is there an application fee?‎



Are there networking opportunities to interact with other students?‎

Coursera does not grant credit, and does not represent that any institution other than the degree granting institution will recognize the credit or credential awarded by the institution; the decision to grant, accept, or transfer credit is subject to the sole and absolute discretion of an educational institution.



We encourage you to investigate whether this degree meets your academic and/or professional needs before applying.}